
## Plan Result

[CI link](https://github.com/l-1cm-l/gha_playground/actions/runs/13856890463)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * aws_s3_bucket.example2
* Delete
  * google_storage_bucket.test_bucket_202503131452
  * google_storage_bucket.test_bucket_202503131455


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.example2 will be created
  + resource "aws_s3_bucket" "example2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "202502121629t-2146"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.test_bucket_202503131452 will be destroyed
  # (because google_storage_bucket.test_bucket_202503131452 is not in configuration)
  - resource "google_storage_bucket" "test_bucket_202503131452" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "test-bucket-202503131452" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-NORTHEAST1" -> null
      - name                        = "test-bucket-202503131452" -> null
      - project                     = "dev-ss-444303" -> null
      - project_number              = 1049987498512 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-202503131452" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://test-bucket-202503131452" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-03-13T06:09:12.140Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

  # google_storage_bucket.test_bucket_202503131455 will be destroyed
  # (because google_storage_bucket.test_bucket_202503131455 is not in configuration)
  - resource "google_storage_bucket" "test_bucket_202503131455" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "test-bucket-202503131455" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-NORTHEAST1" -> null
      - name                        = "test-bucket-202503131455" -> null
      - project                     = "dev-ss-444303" -> null
      - project_number              = 1049987498512 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-202503131455" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://test-bucket-202503131455" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-03-13T06:09:12.756Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-googlecloud-terraform-plan","PRNumber":68,"Program":"tfcmt","SHA1":"a91a21ae89703f3b805b9544509b50e13e78f069","Vars":{},"WorkflowName":"terraform-plan"} -->